{"inkVersion":21,"root":[["\n","\n","\n",{"->":"Intro"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"teamAssign":["ev","^Team",1,"listInt","/ev",{"VAR=":"teamOne","re":true},"\n","ev","^Team",2,"listInt","/ev",{"VAR=":"teamTwo","re":true},"\n","ev","^Team",3,"listInt","/ev",{"VAR=":"teamThree","re":true},"\n",{"#f":1}],"ship":[["ev","str","^Chosen First","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Chosen Second","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Chosen Third","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ",{"->":"chosen_first"},"\n",{"#f":5}],"c-1":["^ ",{"->":"chosen_second"},"\n",{"#f":5}],"c-2":["^ ",{"->":"chosen_third"},"\n","done",{"#f":5}]}],{"#f":1}],"chosen_first":[["^Rebecca starts up the ship’s PA system and broadcasts a message to the entire crew.","\n","^C: Alright everyone! We’re headed off to the first planet for our expedition! I’ve decided to start us with Regis B. It seems similar to our atmosphere so I figured it’d be a good start.","\n","^In her room as she finishes unpacking, Iris lets out a squeal of excitement at the prospect of discovering alien plants that are sure to be thriving on a planet similar to earth.","\n","^In the animal lab, Lars begins preparing crates for any fauna that roam this planet's surface.","\n","^Willy walks around the cargo bay with a satchel in hand, browsing their supplies and packing rations of food, water, knives, rope, and other survival gear he thinks will be necessary for those going out on the expedition.","\n","^Hearing Rebecca come onto the PA system again, Giorgio looks over his notes of the different crew members preparing to choose the team that will explore the surface.","\n","^C: Brace yourselves everyone! This ride’s about to get a lot rougher!","\n","ev","str","^Enter Planet Coordinates","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":".^.^.^.coordinates"},"\n",{"#f":5}]}],{"coordinates":[["^Rebecca types the coordinates of Regis B into her interplanetary navigation system, or INS, and charts the course through the stars. Starting to push the ship into max hyperdrive, Rebecca prepares for a lightspeed launch across the cosmos.","\n","^As the ship shakes heavily with turbulence, Dr. Ridan is woken from an accidental slumber that he fell into sitting at the desk of the medbay.","\n","ev","str","^NEXT","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":".^.^.^.^.ridan_wakes"},"\n",{"#f":5}]}],{"#f":1}],"ridan_wakes":[["^Ridan: (to himself) Finally taking off I guess. Guess I should get back to work…","\n","^Ridan begins to organize the rest of his supplies but is knocked onto the sick bed by another sudden jolt where he quickly dozes off to sleep once again.","\n","ev","str","^NEXT","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":".^.^.^.^.pa_system"},"\n",{"#f":5}]}],{"#f":1}],"pa_system":[["^After about an hour of travel with the various crew members preparing themselves for the true start to their expedition, Rebecca comes onto the PA system once again.","\n","^C: Get ready everyone! We’re enterin’ Regis B’s atmosphere as I speak!","\n","^The loud announcement wakes Ridan up once again and the rest of the crew is brought to attention. Giorgio makes his way to the cockpit and takes the PA system.","\n","^Giorgio: All crew members report to the cargo bay. We’ve got to prepare for our first expedition!","\n","^His stern voice implies urgency as he runs on Winter Daniels’s time. Ridan begrudgingly stands and makes his way to the back of the ship. Iris and Lars run into each other in the hallway and walk together to the cargo bay. Willy had never left the bay and sits on boxes waiting for the rest of the crew to arrive.","\n","ev","str","^NEXT","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":".^.^.^.^.regis_b"},"\n",{"#f":5}]}],{"#f":1}],"regis_b":["^Rebecca finishes the landing procedure just as roughly as she had when picking up the crew. Everyone felt a large rumble throughout the ship as it came to a halt. Iris falls down to the ground with Lars helping her up soon after. Ridan stumbles around but manages to catch himself saving himself from tumbling to the ground. Willy braces himself on the boxes he sits on top of.","\n","^Giorgio: You have to work on that landing Captain. I know this is your ship, but other people are on it now and you hold responsibility for them.","\n","^C: Understood Doc! I’ll try ‘nd work on that!!","\n","^Moments later, the ship’s engine is turned off and Giorgio and Rebecca walk into the cargo bay together. The rest of the crew draws their attention to them.","\n","^Giorgio: I’ll be sending out a few of you to do the research we need! The rest of you will stay on the ship and do anything else to help contribute! I’ll be staying on the ship to continue my own work. ",{"->":".^.^.expedition_choice"},"\n",{"#f":1}],"expedition_choice":[["^The Team Roster: ","ev",{"VAR?":"Team"},"out","/ev","\n","ev","str","^Captain Rebecca Monroe","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Willy Richardson","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Iris Peacetree","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Lars Clarkson","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Ridan Tyndale","/str","/ev",{"*":".^.c-4","flg":20},{"c-0":["\n","^Giorgio: Rebecca, why don’t you get out there and explore a bit?","\n","^C: I should probably stay on the ship and check to make sure all the systems are still raring to go!","\n","^Giorgio: That makes sense.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","ev",{"VAR?":"Team"},{"VAR?":"Willy"},"+",{"VAR=":"Team","re":true},"/ev","^Giorgio: Willy, we could use-","\n","^Willy cuts Giorgio off","\n","^Willy: Sergeant.","\n","^Giorgio looks annoyed at being interrupted.","\n","^Giorgio: (mockingly) Sergeant, I know your survival skills are high quality. Make sure no one gets hurt.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","ev",{"VAR?":"Team"},{"VAR?":"Iris"},"+",{"VAR=":"Team","re":true},"/ev","^Giorgio: Iris, this planet seems to be covered in different plant species. We could use someone like you out there to gather the best information we can.","\n","^Iris: Ooh ooh thank you so much! I won’t let you down!!","\n","ev",{"VAR?":"Team"},{"list":{"Team.Lars":4}},"?","/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"chosen_first.shared_smile"},{"->":".^.^.^.17"},null]}],"nop","\n",{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n","ev",{"VAR?":"Team"},{"VAR?":"Lars"},"+",{"VAR=":"Team","re":true},"/ev","^Giorgio: Lars, this planet has the perfect conditions for life, why don’t you get out there and see if you can find anything!","\n","^Lars: I’ll do my best, sir. Thank you for the opportunity!","\n","ev",{"VAR?":"Team"},{"list":{"Team.Iris":3}},"?","/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"chosen_first.shared_smile"},{"->":".^.^.^.17"},null]}],"nop","\n",{"->":".^.^.g-0"},{"#f":5}],"c-4":["\n","ev",{"VAR?":"Team"},{"VAR?":"Ridan"},"+",{"VAR=":"Team","re":true},"/ev","^Giorgio: Ridan, you seem like you’d be a good fit for this expedition.","\n","^Ridan groans but doesn’t have the willpower to fight back so he accepts his fate","\n","^Ridan: If I have to…","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":[["ev",{"VAR?":"Team"},"LIST_COUNT",3,"<","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":".^.^.^.^.^"},{"->":".^.^.^.2"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"chosen_first.team_with"},{"->":".^.^.^.2"},null]}],"nop","\n",{"#f":5}]}],{"#f":1}],"shared_smile":["^Lars and Iris glance at each other sharing a warm smile.","\n",["ev",{"VAR?":"Team"},"LIST_COUNT",3,"<","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":".^.^.^.^.expedition_choice"},{"->":".^.^.^.4"},null]}],[{"->":".^.b"},{"b":["\n",{"->":".^.^.^.^.team_with"},{"->":".^.^.^.4"},null]}],"nop","\n",{"#f":1}],"team_with":["^Giorgio: Alright crew! Those of you chosen finish getting ready to head out. The rest of you stay on the ship and keep doing the work expected of you. This is not a vacation!","\n","^The chosen crew of ","ev",{"VAR?":"Team"},"out","/ev","^ finish packing up their supplies. Giorgio enters in the code to open the cargo bay door and the crew steps out onto Regis B.","\n","^Looking around the planet, the researchers are met with bright light as the sun reflects off of the cerulean oceans sprawling to the horizon. The rhythmic splashing of the ocean’s currents on the shore and the salty smell of the atmosphere reminds the crew of beaches back on Earth. In the distance, the green peaks of neighboring islands can be made out. The air is heavy and humid creating a thick feeling all around them with tropical heat brushing over them.","\n","^Preparing to explore the planet the researchers have to decide where to start gathering research.","\n",{"->":".^.^.explore"},{"#f":1}],"explore":[["ev","str","^Walk the shoreline","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Enter the inland forest","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Venture out on the coastline, return in the forest","/str",{"VAR?":"Team"},{"list":{"Team.Willy":2}},"?","/ev",{"*":".^.c-2","flg":21},{"c-0":["\n",{"->":".^.^.^.^.shoreline"},{"#f":5}],"c-1":["\n",{"->":".^.^.^.^.forest"},{"#f":5}],"c-2":["\n","ev",true,"/ev",{"VAR=":"both_routes","re":true},{"->":".^.^.^.^.shoreline"},{"#f":5}]}],{"#f":1}],"shoreline":["^Expedition Team: ","ev",{"VAR?":"Team"},"out","/ev","\n","^The researchers walk the coastline and take in the scenery. The beautiful shoreline and tropical smells bring a serene sense of peace to all of them. ",{"->":".^.^.shoreline_interactions"},"\n",{"#f":1}],"shoreline_interactions":[["ev","str","^Lars","/str",{"VAR?":"Team"},{"list":{"Team.Lars":4}},"?","/ev",{"*":".^.c-0","flg":21},"ev","str","^Iris","/str",{"VAR?":"Team"},{"list":{"Team.Iris":3}},"?","/ev",{"*":".^.c-1","flg":21},"ev","str","^lars & Iris","/str",{"VAR?":"Team"},{"list":{"Team.Lars":4,"Team.Iris":3}},"?","/ev",{"*":".^.c-2","flg":21},"ev","str","^Forest","/str",{"VAR?":"both_routes"},"/ev",{"*":".^.c-3","flg":21},{"*":".^.c-4","flg":24},{"c-0":["\n","^Along the shore, Lars notices animal prints in the sand. He signals to the other researchers on the expedition to remain quiet and move slowly. He pulls out a net from his bag and begins to follow the prints. Hearing some ruffling in a nearby bush, he casts the net out and pulls it back, capturing the alien species and placing it in a cage.","\n","^Lars: Good start to a new planet! Already captured my first specimen!","\n","^The other crew members seem happy with his success and continue on their expedition.","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^Iris notices some seaweed like plants that washed onto shore. Putting a glove on her hand and taking out a small plastic bag, she picks up the plant and places it into the bag.","\n","^Iris: Already got my first plant to research!! This is gonna be so so so much fun!!","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["\n","^Iris: I always wished to visit the beaches on Earth more. I never really had the chance to just walk the coastline like this with someone. It’s so exciting to be somewhere new and get an experience like this!!","\n","^Lars: It is nice just getting to walk the shore and take in the sights. It’s different from anything I’ve done before, that’s for sure.","\n","^The two smile at each other warmly. (Third crew member) feels out of place, as though they’re the third wheel on a date.","\n",{"->":".^.^.^"},{"#f":5}],"c-3":["\n","^Finishing up collecting data they need on the shoreline, the researchers decide to venture deeper inland to the forest covering the island. ",{"->":".^.^.^.^.forest"},"\n",{"#f":5}],"c-4":["\n","^The crew takes temperatures of the atmosphere and water, recording them to meet the required quota of research data and continues on their way.","\n","^Finishing up everything they could do on the shoreline, the researchers decide that they’ve collected enough data to return to the ship and turn around, retracing their steps in the sand back to where they came from. ",{"->":"returning_to_ship"},"\n",{"#f":5}]}],{"#f":1}],"forest":["ev",{"VAR?":"Team"},"out","/ev","\n","^Entering into the vast forest, the crew is met with lush foliage and thick brush under their feet. It was hard to believe that they were on an island as they were surrounded by thick jungle with no sight of the shore. ",{"->":".^.^.forest_interactions"},"\n",{"#f":1}],"forest_interactions":[["ev","str","^Iris","/str",{"VAR?":"Team"},{"list":{"Team.Iris":3}},"?","/ev",{"*":".^.c-0","flg":21},"ev","str","^Lars","/str",{"VAR?":"Team"},{"list":{"Team.Lars":4}},"?","/ev",{"*":".^.c-1","flg":21},"ev","str","^lars & Iris","/str",{"VAR?":"Team"},{"list":{"Team.Lars":4,"Team.Iris":3}},"?","/ev",{"*":".^.c-2","flg":21},"ev","str","^Leave","/str",{"VAR?":"both_routes"},"/ev",{"*":".^.c-3","flg":21},{"*":".^.c-4","flg":24},{"c-0":["\n","^Iris: I don’t even know where to begin!! There are so so so many different species here I’ve never seen before. It’s all so foreign I have to get a little bit of everything!!","\n","^Iris spends the next 30 minutes cutting away pieces of every plant she can find, keeping them in their own bags to research on the ship later. She tries to collect as many seeds, spores, and cones as possible to try and regrow these plants aboard the ship as well. ",{"->":".^.^.^"},"\n",{"#f":5}],"c-1":["\n","^Lars hears cries from different animals all around him in the jungle. Knowing he realistically won’t be able to capture them all, he lays a trap out putting bait into a cage meant for field research and instructs the crew to quietly wait with him in a nearby bush. After what felt like hours of waiting, the other members of the crew began drifting off as Lars patiently watched the cage. Soon thereafter, an animal looking like a small cat sneaks into the cage and begins eating the bait. Lars rushes over and closes the door trapping the animal inside.","\n","^Lars: Got it!!","\n","^Lars’s shout jolts the other two researchers awake and they approach him and the cage, peering at the animal they just trapped.","\n","^(Researcher 2): It’s kinda cute!","\n","^Moving on, Lars decided to spare the time of everyone else that this is the only trap he will set. As the crew continues to venture through the forest, he picks up any bugs and smaller, easier to catch animals that he can. ",{"->":".^.^.^"},"\n",{"#f":5}],"c-2":["\n","^Iris clumsily trips over the vines lining the floor of the forest. Lars rushes over to help her up and make sure she’s ok.","\n","^Lars: Is everything alright, Iris? That looks like it could’ve hurt!","\n","^Iris: Yea, I’m alright I think! I’m used to tripping over and falling.","\n","^Lars and Iris laugh together as Lars helps Iris stand up. The two of them continue on ahead, leaving (3rd crew member) trailing behind. ",{"->":".^.^.^"},"\n",{"#f":5}],"c-3":["\n","^Willy leads the crew through the forest, tracking the movement of astral bodies and listening for the sounds of the waves to find their way back to the ship.","\n","^Willy: This turf ain’t nuthin’! I could navigate us back to the ship with my eyes closed and both arms tied behind my back! I was hoping for a real struggle in the adventurin’ out here!","\n","^The researchers find their way out of the forest with an efficient use of their time and head back onto the ship. Willy, feeling like he led them through the toughest journey of their lives, feels especially rewarded for his ability to lead them around the planet effectively. ",{"->":"returning_to_ship"},"\n",{"#f":5}],"c-4":["\n","^The researchers feel that they’ve collected sufficient amounts of data and turn around, stumbling their way through the woods to find their way back to the ship. ",{"->":"returning_to_ship"},"\n",{"#f":5}]}],{"#f":1}],"#f":1}],"returning_to_ship":[["ev","str","^Head Back","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","ev",{"list":{}},"/ev",{"VAR=":"Team","re":true},"ev",false,"/ev",{"VAR=":"both_routes","re":true},{"->":"ship_base"},{"#f":5}]}],{"#f":1}],"chosen_second":[["^Rebecca starts up the ship’s PA system and broadcasts a message to the entire crew.","\n","^C: Good work everyone! We’re headed off to the next planet for our expedition! I’ve decided to bring us to Regis B. It seems similar to our atmosphere so I figured it’d be a nice place to go!!","\n","^In her room reading a book on modern agricultural practices, Iris lets out a squeal of excitement at the prospect of discovering alien plants that are sure to be thriving on a planet similar to earth.","\n","^In the animal lab, Lars begins preparing new crates for any fauna that roam this planet's surface.","\n","^Willy goes back to the cargo, scanning the remaining supplies and packing more rations of food, water, knives, rope, and other gear that he thinks the crew might use out on the expedition.","\n","^Hearing Rebecca come onto the PA system again, Giorgio looks over his notes of the different crew members preparing to choose the team that will explore the surface.","\n","^C: Alright! Time to head off! I’ll try to make this trip a bit smoother than the last time!","\n","ev","str","^Enter Planet Coordinates","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":".^.^.^.coordinates"},"\n",{"#f":5}]}],{"coordinates":[["^Rebecca types the coordinates of Regis B into her INS charting the course through the stars. Pushing the ship into hyperdrive but ensuring not to max out the throttle, Rebecca prepares for another lightspeed launch across the cosmos.","\n","ev","str","^NEXT","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":".^.^.^.^.regis_b2"},"\n",{"#f":5}]}],{"#f":1}],"regis_b2":["^The trip takes about four hours to get over to Regis B and as the ship nears its destination, Rebecca comes onto the PA system once again.","\n","^C: We’re finally here! Sorry it took so long, but we’re enterin’ Regis B’s atmosphere now!","\n","^Giorgio heads up to the cockpit for another announcement over the PA system.","\n","^Giorgio: You all know the drill by now. All crew members report to the cargo bay. We’ve got another expedition to head out on!","\n","^Giorgio is less stern, but has concerns about losing funding from Winter Daniels. Ridan leaves his office to join the company of the crew in the back of the ship. Iris and Lars meet up outside their labs so that they can walk to the back of the ship with one another. Willy was still in the bay making the final preparations for the expedition packs.","\n","^Rebecca lands the crew much more smoothly this time around. There was still a rough jolt that shook the ship as it touched down, but significantly less than the last time. Lars holds Iris up to keep her from falling over again. Ridan plants his feet firmly stabilizing himself. Willy leans against a wall to help maintain his balance as he is ready for the touchdown.","\n","^Giorgio: Much better landing this time around Rebecca! I can tell you’re trying your best to be a good captain!","\n","^C: Thank you Giorgio! I’ll keep trying my hardest!","\n","^Moments later, the ship’s engine is turned off and Giorgio and Rebecca walk into the cargo bay together. The researchers all turn their attention to the two of them.","\n","^Giorgio: As you all know, I’ll be sending out a few of you to do the research we need! The people I don’t choose will stay on the ship and do any research that they can! Just like last time, I will be staying on the ship myself to continue my own work. ",{"->":".^.^.expedition_choice"},"\n",{"#f":1}],"expedition_choice":[["^The Team Roster: ","ev",{"VAR?":"Team"},"out","/ev","\n","ev","str","^Captain Rebecca Monroe","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Willy Richardson","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Iris Peacetree","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Lars Clarkson","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Ridan Tyndale","/str","/ev",{"*":".^.c-4","flg":20},{"c-0":["\n","^Giorgio: I’m assuming you still need to stay on the ship, Rebecca?","\n","^Captain Rebecca: Yea! There’s a few things I should check out on the ship while the researchers are out!","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","ev",{"VAR?":"Team"},{"VAR?":"Willy"},"+",{"VAR=":"Team","re":true},"/ev","^Giorgio: Willy, you think-","\n","^Willy cuts Giorgio off","\n","^Willy: It’s still sergeant.","\n","^Giorgio glares at Willy for interrupting him.","\n","^Giorgio: (mockingly) OK sergeant, I know your survival skills are high quality. The thick forest here seems like a perfect environment for you.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","ev",{"VAR?":"Team"},{"VAR?":"Iris"},"+",{"VAR=":"Team","re":true},"/ev","^Giorgio: Iris, this planet seems to be covered in different plant species. We could use someone like you out there to gather the best information we can.","\n","^Iris: Ooh ooh thank you so much! I won’t let you down!!","\n","ev",{"VAR?":"Team"},{"list":{"Team.Lars":4}},"?","/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":".^.^.^.^.^.^.hold_hands"},{"->":".^.^.^.17"},null]}],"nop","\n",{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n","ev",{"VAR?":"Team"},{"VAR?":"Lars"},"+",{"VAR=":"Team","re":true},"/ev","^Giorgio: Lars, this planet has the perfect conditions for life, why don’t you get out there and see if you can find anything!","\n","^Lars: I’ll do my best, sir. Thank you for the opportunity!","\n","ev",{"VAR?":"Team"},{"list":{"Team.Iris":3}},"?","/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":".^.^.^.^.^.^.hold_hands"},{"->":".^.^.^.17"},null]}],"nop","\n",{"->":".^.^.g-0"},{"#f":5}],"c-4":["\n","ev",{"VAR?":"Team"},{"VAR?":"Ridan"},"+",{"VAR=":"Team","re":true},"/ev","^Giorgio: Ridan, you seem like you’d be a good fit for this expedition.","\n","^Ridan groans but doesn’t have the willpower to fight back so he accepts his fate","\n","^Ridan: If I have to…","\n",["ev",{"VAR?":"Team"},"LIST_COUNT",3,"<","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":".^.^.^.^.^"},{"->":".^.^.^.15"},null]}],[{"->":".^.b"},{"b":["\n",{"->":".^.^.^.^.^.^.team_with"},{"->":".^.^.^.15"},null]}],"nop","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":[["ev",{"VAR?":"Team"},"LIST_COUNT",3,"<","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":".^.^.^.^.^"},{"->":".^.^.^.2"},null]}],[{"->":".^.b"},{"b":["\n",{"->":".^.^.^.^.^.^.team_with"},{"->":".^.^.^.2"},null]}],"nop","\n",{"#f":5}]}],{"#f":1}],"hold_hands":["^Lars and Iris reach out to one another and hold hands.","\n",["ev",{"VAR?":"Team"},"LIST_COUNT",3,"<","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":".^.^.^.^.expedition_choice"},{"->":".^.^.^.4"},null]}],[{"->":".^.b"},{"b":["\n",{"->":".^.^.^.^.team_with"},{"->":".^.^.^.4"},null]}],"nop","\n",{"#f":1}],"team_with":["^Giorgio: Alright crew, Willy… (sarcastically) I mean Sergeant Willy, packed up everything you should need for the expedition. The rest of you staying on the ship, keep up the good work! Just another reminder, this is not a vacation!","\n","^The chosen crew of (choice 1), (choice 2), and (choice 3) finish packing up their supplies. Giorgio enters in the code to open the cargo bay door and the crew steps out onto Regis B.","\n","^Looking around the planet, the researchers are met with bright light as the sun reflects off of the cerulean oceans sprawling to the horizon. The rhythmic splashing of the ocean’s currents on the shore and the salty smell of the atmosphere reminds the crew of beaches back on Earth. In the distance, the green peaks of neighboring islands can be made out. The air is heavy and humid creating a thick feeling all around them with tropical heat brushing over them.","\n","^Preparing to explore the planet the researchers have to decide where to start gathering research.","\n",{"->":".^.^.explore"},{"#f":1}],"explore":[["ev","str","^Walk the shoreline","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Enter the inland forest","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Venture out on the coastline, return in the forest","/str",{"VAR?":"Team"},{"list":{"Team.Willy":2}},"?","/ev",{"*":".^.c-2","flg":21},{"c-0":["\n",{"->":".^.^.^.^.shoreline"},{"#f":5}],"c-1":["\n",{"->":".^.^.^.^.forest"},{"#f":5}],"c-2":["\n","ev",true,"/ev",{"VAR=":"both_routes","re":true},{"->":".^.^.^.^.shoreline"},{"#f":5}]}],{"#f":1}],"shoreline":["^Expedition Team: ","ev",{"VAR?":"Team"},"out","/ev","\n","^The researchers walk the coastline and take in the scenery. The beautiful shoreline and tropical smells bring a serene sense of peace to all of them. ",{"->":".^.^.shoreline_interactions"},"\n",{"#f":1}],"shoreline_interactions":[["ev","str","^Lars","/str",{"VAR?":"Team"},{"list":{"Team.Lars":4}},"?","/ev",{"*":".^.c-0","flg":21},"ev","str","^Iris","/str",{"VAR?":"Team"},{"list":{"Team.Iris":3}},"?","/ev",{"*":".^.c-1","flg":21},"ev","str","^lars & Iris","/str",{"VAR?":"Team"},{"list":{"Team.Lars":4,"Team.Iris":3}},"?","/ev",{"*":".^.c-2","flg":21},"ev","str","^Forest","/str",{"VAR?":"both_routes"},"/ev",{"*":".^.c-3","flg":21},{"*":".^.c-4","flg":24},{"c-0":["\n","^Along the shore, Lars notices animal prints in the sand. He signals to the other researchers on the expedition to remain quiet and move slowly. He pulls out a net from his bag and begins to follow the prints. Hearing some ruffling in a nearby bush, he casts the net out and pulls it back, capturing the alien species and placing it in a cage.","\n","^Lars: Good start to a new planet! Already captured my first specimen!","\n","^The other crew members seem happy with his success and continue on their expedition.","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^Iris notices some seaweed like plants that washed onto shore. Putting a glove on her hand and taking out a small plastic bag, she picks up the plant and places it into the bag.","\n","^Iris: Got another plant to research! Aqua-based specimens are always fun to learn about!!","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["\n","^Iris: I always wished to visit the beaches on Earth more. I never really had the chance to just walk the coastline like this with someone. It’s so exciting to be somewhere new and get an experience like this!!","\n","^Lars: It is nice just getting to walk the shore and take in the sights. It’s different from anything I’ve done before, that’s for sure.","\n","^The two smile at each other warmly. (Third crew member) feels out of place, as though they’re the third wheel on a date.","\n",{"->":".^.^.^"},{"#f":5}],"c-3":["\n","^Finishing up collecting data they need on the shoreline, the researchers decide to venture deeper inland to the forest covering the island. ",{"->":".^.^.^.^.forest"},"\n",{"#f":5}],"c-4":["\n","^The crew takes temperatures of the atmosphere and water, recording them to meet the required quota of research data and continues on their way.","\n","^Finishing up everything they could do on the shoreline, the researchers decide that they’ve collected enough data to return to the ship and turn around, retracing their steps in the sand back to where they came from. ",{"->":"returning_to_ship"},"\n",{"#f":5}]}],{"#f":1}],"forest":["ev",{"VAR?":"Team"},"out","/ev","\n","^Entering into the vast forest, the crew is met with lush foliage and thick brush under their feet. It was hard to believe that they were on an island as they were surrounded by thick jungle with no sight of the shore. ",{"->":".^.^.forest_interactions"},"\n",{"#f":1}],"forest_interactions":[["ev","str","^Iris","/str",{"VAR?":"Team"},{"list":{"Team.Iris":3}},"?","/ev",{"*":".^.c-0","flg":21},"ev","str","^Lars","/str",{"VAR?":"Team"},{"list":{"Team.Lars":4}},"?","/ev",{"*":".^.c-1","flg":21},"ev","str","^lars & Iris","/str",{"VAR?":"Team"},{"list":{"Team.Lars":4,"Team.Iris":3}},"?","/ev",{"*":".^.c-2","flg":21},"ev","str","^Leave","/str",{"VAR?":"both_routes"},"/ev",{"*":".^.c-3","flg":21},{"*":".^.c-4","flg":24},{"c-0":["\n","^Iris: I don’t even know where to begin!! There are so so so many different species here I’ve never seen before. It’s all so foreign I have to get a little bit of everything!!","\n","^Iris spends the next 30 minutes cutting away pieces of every plant she can find, keeping them in their own bags to research on the ship later. She tries to collect as many seeds, spores, and cones as possible to try and regrow these plants aboard the ship as well. ",{"->":".^.^.^"},"\n",{"#f":5}],"c-1":["\n","^Lars hears cries from different animals all around him in the jungle. Knowing he realistically won’t be able to capture them all, he lays a trap out putting bait into a cage meant for field research and instructs the crew to quietly wait with him in a nearby bush. After what felt like hours of waiting, the other members of the crew began drifting off as Lars patiently watched the cage. Soon thereafter, an animal looking like a small cat sneaks into the cage and begins eating the bait. Lars rushes over and closes the door trapping the animal inside.","\n","^Lars: Got it!!","\n","^Lars’s shout jolts the other two researchers awake and they approach him and the cage, peering at the animal they just trapped.","\n","^(Researcher 2): It’s kinda cute!","\n","^Moving on, Lars decided to spare the time of everyone else that this is the only trap he will set. As the crew continues to venture through the forest, he picks up any bugs and smaller, easier to catch animals that he can. ",{"->":".^.^.^"},"\n",{"#f":5}],"c-2":["\n","^Iris clumsily trips over the vines lining the floor of the forest. Lars rushes over to help her up and make sure she’s ok.","\n","^Lars: Is everything alright, Iris? That looks like it could’ve hurt!","\n","^Iris: Yea, I’m alright I think! I’m used to tripping over and falling.","\n","^Lars and Iris laugh together as Lars helps Iris stand up. The two of them continue on ahead, leaving (3rd crew member) trailing behind. ",{"->":".^.^.^"},"\n",{"#f":5}],"c-3":["\n","^Willy leads the crew through the forest, tracking the movement of astral bodies and listening for the sounds of the waves to find their way back to the ship.","\n","^Willy: This turf ain’t nuthin’! I could navigate us back to the ship with my eyes closed and both arms tied behind my back! I was hoping for a real struggle in the adventurin’ out here!","\n","^The researchers find their way out of the forest with an efficient use of their time and head back onto the ship. Willy, feeling like he led them through the toughest journey of their lives, feels especially rewarded for his ability to lead them around the planet effectively. ",{"->":"returning_to_ship"},"\n",{"#f":5}],"c-4":["\n","^The researchers feel that they’ve collected sufficient amounts of data and turn around, stumbling their way through the woods to find their way back to the ship. ",{"->":"returning_to_ship"},"\n",{"#f":5}]}],{"#f":1}],"#f":1}],"chosen_third":[["^Rebecca starts up the ship’s PA system and broadcasts a message to the entire crew.","\n","^Captain Rebecca: Great work crew! We’re headed off to the last planet for our expedition! I’ve decided to finish Regis B. It seems similar to our atmosphere so I figured it’d be a nice place to remind us of home!!","\n","^In her lab researching the specimens gathered on the previous expeditions, Iris lets out a squeal of excitement at the prospect of discovering alien plants that are sure to be thriving on a planet similar to earth.","\n","^In the animal lab, Lars begins preparing new crates for any fauna that roam this planet's surface while finishing up some research he was doing on specimens taken from the last planets.","\n","^Willy goes back to the cargo, parsing through the last remaining supplies and packing the last rations of food, water, knives, rope, and other gear that he thinks the others might need.","\n","^Hearing Rebecca come onto the PA system again, Giorgio looks over his notes of the different crew members preparing to choose the team that will explore the surface for the last time.","\n","^C: Smooth sailing from here on out! I think I’ve figured how to fly this to all of your comfort!","\n","ev","str","^Enter Planet Coordinates","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":".^.^.^.coordinates"},"\n",{"#f":5}]}],{"coordinates":[["^Rebecca types the coordinates of Regis B into her INS charting the course through the stars. Pushing the ship into hyperdrive, setting it at a lower speed, Rebecca starts up another lightspeed launch across the cosmos.","\n","ev","str","^NEXT","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":".^.^.^.^.regis_b3"},"\n",{"#f":5}]}],{"#f":1}],"regis_b3":["^The trip takes about two and a half hours to get over to Regis B and as the ship nears its destination, Rebecca comes onto the PA system once again.","\n","^C: We’re finally here! Hope it was a smooth trip for all of you! We’re touching down in Regis B as I speak!!","\n","^Giorgio heads up to the cockpit for another announcement over the PA system.","\n","^Giorgio: Alright everyone! This is the last time I’ll be making this announcement but all crew members report back to the cargo bay!","\n","^Giorgio is much less relaxed having made it through almost the entire research expedition without any major incidents. Ridan finishes up in his office to join with everyone else. Iris and Lars wait for each other in the hallway, hugging and taking the other’s hand before journeying to the back of the ship. Willy already finished packing the expedition bags for everyone and was relaxing in the cargo bay waiting for everyone else.","\n","^Rebecca’s landing was perfect, not a single tremor as the ship settled on the ground. Lars and Iris stood hand in hand waiting for the captain and Giorgio. Ridan and Willy stood near each other, talking quietly amongst themselves as they prepared for the last excursion.","\n","^Giorgio: Perfect landing Rebecca! You’ve gotten much better at handling a ship with other people on it!","\n","^C: Thank you Gio! I’m glad I was able to be the captain for your research!","\n","^Moments later, the ship’s engine is turned off and Giorgio and Rebecca walk into the cargo bay together. The researchers all turn their attention to the two of them.","\n","^Giorgio: I’m sure you all know exactly what I’m gonna say, but I’ll be sending out three of you to do the final research we need! The people I don’t choose will stay on the ship and finish up all the research that they can! I think I’ll be heading out and helping with the field work this time around! ",{"->":".^.^.expedition_choice"},"\n",{"#f":1}],"expedition_choice":[["^The Team Roster: ","ev",{"VAR?":"Team"},"out","/ev","\n","ev","str","^Captain Rebecca Monroe","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Willy Richardson","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Iris Peacetree","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Lars Clarkson","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Ridan Tyndale","/str","/ev",{"*":".^.c-4","flg":20},{"c-0":["\n","^Giorgio: I’m assuming you still need to stay on the ship, Rebecca?","\n","^Captain Rebecca: Yup! Gotta start getting the ship ready for the return trip!!","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","ev",{"VAR?":"Team"},{"VAR?":"Willy"},"+",{"VAR=":"Team","re":true},"/ev","^Giorgio: Willy, you think this planet is up your alley? It’s covered in forests and I think you’d be great at leading the field team around!","\n","^Willy: It’s still sergeant, but I’ll head out there and take charge! I’d love to show people the way around!!","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","ev",{"VAR?":"Team"},{"VAR?":"Iris"},"+",{"VAR=":"Team","re":true},"/ev","^Giorgio: Iris, this planet seems to be covered in different plant species. We could use someone like you out there to gather the best information we can.","\n","^Iris: Ooh ooh thank you so much! I won’t let you down!!","\n","ev",{"VAR?":"Team"},{"list":{"Team.Lars":4}},"?","/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"chosen_third.cuddle"},{"->":".^.^.^.17"},null]}],"nop","\n",{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n","ev",{"VAR?":"Team"},{"VAR?":"Lars"},"+",{"VAR=":"Team","re":true},"/ev","^Giorgio: Lars, this planet has the perfect conditions for life, why don’t you get out there and see if you can find anything!","\n","^Lars: I’ll keep doing my best, sir. Thank you for the opportunity!","\n","ev",{"VAR?":"Team"},{"list":{"Team.Iris":3}},"?","/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"chosen_third.cuddle"},{"->":".^.^.^.17"},null]}],"nop","\n",{"->":".^.^.g-0"},{"#f":5}],"c-4":["\n","ev",{"VAR?":"Team"},{"VAR?":"Ridan"},"+",{"VAR=":"Team","re":true},"/ev","^Giorgio: Ridan, you seem like you’d be a good fit for this expedition.","\n","^Ridan still isn’t eager to venture out but he isn’t adamantly opposed.","\n","^Ridan: I guess I can head out…","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":[["ev",{"VAR?":"Team"},"LIST_COUNT",3,"<","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":".^.^.^.^.^"},{"->":".^.^.^.2"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"chosen_third.team_with"},{"->":".^.^.^.2"},null]}],"nop","\n",{"#f":5}]}],{"#f":1}],"cuddle":["^Lars and Iris link arms and cuddle up to one another.","\n",["ev",{"VAR?":"Team"},"LIST_COUNT",3,"<","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":".^.^.^.^.expedition_choice"},{"->":".^.^.^.4"},null]}],[{"->":".^.b"},{"b":["\n",{"->":".^.^.^.^.team_with"},{"->":".^.^.^.4"},null]}],"nop","\n",{"#f":1}],"team_with":["^Giorgio: Alright crew, Sergeant Willy packed up all the supplies we’ll need for the expedition. Everyone staying on the ship, I trust that you’ll keep doing your work! Last reminder, this still is not a vacation!","\n","^The chosen crew of (choice 1), (choice 2), and (choice 3) alongside Giorgio finish collecting their supplies. Giorgio enters in the code to open the cargo bay door and the crew steps out onto Regis B.","\n","^Looking around the planet, the researchers are met with bright light as the sun reflects off of the cerulean oceans sprawling to the horizon. The rhythmic splashing of the ocean’s currents on the shore and the salty smell of the atmosphere reminds the crew of beaches back on Earth. In the distance, the green peaks of neighboring islands can be made out. The air is heavy and humid creating a thick feeling all around them with tropical heat brushing over them.","\n","^Preparing to explore the planet the researchers have to decide where to start gathering research.","\n",{"->":".^.^.explore"},{"#f":1}],"explore":[["ev","str","^Walk the shoreline","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Enter the inland forest","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Venture out on the coastline, return in the forest","/str",{"VAR?":"Team"},{"list":{"Team.Willy":2}},"?","/ev",{"*":".^.c-2","flg":21},{"c-0":["\n",{"->":".^.^.^.^.shoreline"},{"#f":5}],"c-1":["\n",{"->":".^.^.^.^.forest"},{"#f":5}],"c-2":["\n","ev",true,"/ev",{"VAR=":"both_routes","re":true},{"->":".^.^.^.^.shoreline"},{"#f":5}]}],{"#f":1}],"shoreline":["^Expedition Team: ","ev",{"VAR?":"Team"},"out","/ev","\n","^The researchers walk the coastline and take in the scenery. The beautiful shoreline and tropical smells bring a serene sense of peace to all of them. ",{"->":".^.^.shoreline_interactions"},"\n",{"#f":1}],"shoreline_interactions":[["ev","str","^Lars","/str",{"VAR?":"Team"},{"list":{"Team.Lars":4}},"?","/ev",{"*":".^.c-0","flg":21},"ev","str","^Iris","/str",{"VAR?":"Team"},{"list":{"Team.Iris":3}},"?","/ev",{"*":".^.c-1","flg":21},"ev","str","^lars & Iris","/str",{"VAR?":"Team"},{"list":{"Team.Lars":4,"Team.Iris":3}},"?","/ev",{"*":".^.c-2","flg":21},"ev","str","^Forest","/str",{"VAR?":"both_routes"},"/ev",{"*":".^.c-3","flg":21},{"*":".^.c-4","flg":24},{"c-0":["\n","^Along the shore, Lars notices animal prints in the sand. He signals to the other researchers on the expedition to remain quiet and move slowly. He pulls out a net from his bag and begins to follow the prints. Hearing some ruffling in a nearby bush, he casts the net out and pulls it back, capturing the alien species and placing it in a cage.","\n","^Lars: Good start to a new planet! Already captured my first specimen!","\n","^The other crew members seem happy with his success and continue on their expedition.","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^Iris notices some seaweed like plants that washed onto shore. Putting a glove on her hand and taking out a small plastic bag, she picks up the plant and places it into the bag.","\n","^Iris: Already got my first plant to research!! This is gonna be so so so much fun!!","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["\n","^Iris: I always wished to visit the beaches on Earth more. I never really had the chance to just walk the coastline like this with someone. It’s so exciting to be somewhere new and get an experience like this!!","\n","^Lars: It is nice just getting to walk the shore and take in the sights. It’s different from anything I’ve done before, that’s for sure.","\n","^The two smile at each other warmly. (Third crew member) feels out of place, as though they’re the third wheel on a date.","\n",{"->":".^.^.^"},{"#f":5}],"c-3":["\n","^Finishing up collecting data they need on the shoreline, the researchers decide to venture deeper inland to the forest covering the island. ",{"->":".^.^.^.^.forest"},"\n",{"#f":5}],"c-4":["\n","^The crew takes temperatures of the atmosphere and water, recording them to meet the required quota of research data and continues on their way.-","\n","^Finishing up everything they could do on the shoreline, the researchers decide that they’ve collected enough data to return to the ship and turn around, retracing their steps in the sand back to where they came from.","\n",{"->":"Regular"},{"#f":5}]}],{"#f":1}],"forest":["ev",{"VAR?":"Team"},"out","/ev","\n","^Entering into the vast forest, the crew is met with lush foliage and thick brush under their feet. It was hard to believe that they were on an island as they were surrounded by thick jungle with no sight of the shore. ",{"->":".^.^.forest_interactions"},"\n",{"#f":1}],"forest_interactions":[["ev","str","^Iris","/str",{"VAR?":"Team"},{"list":{"Team.Iris":3}},"?","/ev",{"*":".^.c-0","flg":21},"ev","str","^Lars","/str",{"VAR?":"Team"},{"list":{"Team.Lars":4}},"?","/ev",{"*":".^.c-1","flg":21},"ev","str","^lars & Iris","/str",{"VAR?":"Team"},{"list":{"Team.Lars":4,"Team.Iris":3}},"?","/ev",{"*":".^.c-2","flg":21},"ev","str","^Leave","/str",{"VAR?":"both_routes"},"/ev",{"*":".^.c-3","flg":21},{"*":".^.c-4","flg":24},{"c-0":["\n","^Iris: I don’t even know where to begin!! There are so so so many different species here I’ve never seen before. It’s all so foreign I have to get a little bit of everything!!","\n","^Iris spends the next 30 minutes cutting away pieces of every plant she can find, keeping them in their own bags to research on the ship later. She tries to collect as many seeds, spores, and cones as possible to try and regrow these plants aboard the ship as well. ",{"->":".^.^.^"},"\n",{"#f":5}],"c-1":["\n","^Lars hears cries from different animals all around him in the jungle. Knowing he realistically won’t be able to capture them all, he lays a trap out putting bait into a cage meant for field research and instructs the crew to quietly wait with him in a nearby bush. After what felt like hours of waiting, the other members of the crew began drifting off as Lars patiently watched the cage. Soon thereafter, an animal looking like a small cat sneaks into the cage and begins eating the bait. Lars rushes over and closes the door trapping the animal inside.","\n","^Lars: Got it!!","\n","^Lars’s shout jolts the other two researchers awake and they approach him and the cage, peering at the animal they just trapped.","\n","^(Researcher 2): It’s kinda cute!","\n","^Moving on, Lars decided to spare the time of everyone else that this is the only trap he will set. As the crew continues to venture through the forest, he picks up any bugs and smaller, easier to catch animals that he can. ",{"->":".^.^.^"},"\n",{"#f":5}],"c-2":["\n","^Iris clumsily trips over the vines lining the floor of the forest. Lars rushes over to help her up and make sure she’s ok.","\n","^Lars: Is everything alright, Iris? That looks like it could’ve hurt!","\n","^Iris: Yea, I’m alright I think! I’m used to tripping over and falling.","\n","^Lars and Iris laugh together as Lars helps Iris stand up. The two of them continue on ahead, leaving (3rd crew member) trailing behind. ",{"->":".^.^.^"},"\n",{"#f":5}],"c-3":["\n","^Willy leads the crew through the forest, tracking the movement of astral bodies and listening for the sounds of the waves to find their way back to the ship.","\n","^Willy: This turf ain’t nuthin’! I could navigate us back to the ship with my eyes closed and both arms tied behind my back! I was hoping for a real struggle in the adventurin’ out here!","\n","^The researchers find their way out of the forest with an efficient use of their time and head back onto the ship. Willy, feeling like he led them through the toughest journey of their lives, feels especially rewarded for his ability to lead them around the planet effectively. ",{"->":"MasterResearchers"},"\n",{"#f":5}],"c-4":["\n","^The researchers feel that they’ve collected sufficient amounts of data and turn around, stumbling their way through the woods to find their way back to the ship.","\n",{"->":"Regular"},{"#f":5}]}],{"#f":1}],"#f":1}],"Intro":["^The engine slows revs to a stop as the Captain sighs in relief.","\n","^Captain: \"That was kind of a rough landing, but at least the ship is still in one piece for the new crew.\"","\n","^In an excited hop, the woman left her seat and opened the hatch to the landing platform.","\n","^Standing before a sleek metal ship of medium size, a crew of five researchers and professionals stood before the door that she had just opened.","\n","^Captain Rebecca Monroe: \"Hello everyone! I am your new Captain Rebecca Monroe! Before we head onto the ship let's give quick introductions to each other, ok!?\"","\n","^The crew did not seem impressed with the idea of introductions, as some of the groaned or rolled their eyes at the proposal.","\n","^Captain Rebecca Monroe: \"Great! I’ll go first! Hello. As I said I am the Captain, Rebecca Monroe! Feel free to call me Captain, or Rebecca, or Captain Rebecca. I will be running and piloting the ship so please tell me if there are any problems you have while we are on this mission. Ok, who’s next?\"","\n",{"->":"intro"},{"#f":1}],"intro":[[["ev",{"^->":"intro.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^A grumpy older business man who seems to want to get this over as quickly as possible",{"->":"$r","var":true},null]}],["ev",{"^->":"intro.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^A rough military looking man who keeps looking around as if he's “checking the perimeter”",{"->":"$r","var":true},null]}],["ev",{"^->":"intro.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^A bouncy redheaded young woman who looks like she is about to explode if she doesn't start talking",{"->":"$r","var":true},null]}],["ev",{"^->":"intro.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":18},{"s":["^A bored and nerdy looking young man who looks like he would rather do anything else than talk to people",{"->":"$r","var":true},null]}],["ev",{"^->":"intro.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-4","flg":18},{"s":["^A tired looking man in a doctor's coat who looks like he needs a few cups of coffee or a nap",{"->":"$r","var":true},null]}],{"*":".^.c-5","flg":24},{"c-0":["ev",{"^->":"intro.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^Dr. Giorgio Accardi: \"Hello, my name is Dr. Giorgio Accardi. I am the lead researcher and project manager for this mission. All I ask is that no one bothers me while I am doing my research and we won’t have any problems.”","\n","^After introducing himself, the man crossed his arms in disapproval of having to introduce himself to a group he considers to be less intelligent than himself.","\n",{"->":"intro"},{"#f":5}],"c-1":["ev",{"^->":"intro.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^Willy Richardson: \"The names Willy Richarson, but you all will call me sergeant. I am the only thing that can keep your sorry asses alive out there, so you better do everything I say without question! If you can’t handle me you sure as hell can’t handle whatever we’re going to face out there.”","\n","^The man smirks as he puffs out his chest with pride.","\n",{"->":"intro"},{"#f":5}],"c-2":["ev",{"^->":"intro.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n","^Iris Peacetree: \"Hello everyone! I’m Iris! Iris Peacetree! I am the botanist for this mission and I am so excited to be working with all of you guys! I can't wait to get to know all of you better and to also see all of the amazing, wonderful plants that we are going to discover together. OMG I CAN’T WAIT!”","\n","^As she speaks, the woman jumps up and down.","\n",{"->":"intro"},{"#f":5}],"c-3":["ev",{"^->":"intro.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n","^Lars Clarkson: \"Um… H-hi everyone. I-I’m Lars Clarkson. I'm a zoologist. O-or animal behavioral specialist. Or… just… animal scientist.\"","\n","^As he introduced himself, the young man's voice grew quieter and softer.","\n",{"->":"intro"},{"#f":5}],"c-4":["ev",{"^->":"intro.0.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^Dr. Ridan Tyndale: “I am Dr. Ridan Tyndale. I am the doctor incharge of all of your health for this journey. All of you better keep yourselves healthy and safe because I will not be dealing with every single boo boo you come crying to me about!”","\n","^Right as he finished his introduction, the older man let out a loud yawn.","\n",{"->":"intro"},{"#f":5}],"c-5":["\n","^Captain Rebecca Monroe: \"Wonderful I think that’s everyone! Let’s just quickly take an inventory and-”","\n","^Rebecca's suddenly pings on, with the caller ID being from a woman named Winter Daniels. The woman who was responsible for gathering the crew for this project and the provider of the \"wallet\" for the mission.","\n","^Captain Rebecca Monroe: “Oh! Um… Hello Mrs. Daniels!”","\n","^Winter Daniels: “Miss Monroe! Please tell me you have picked up the crew!”","\n","^Captain Rebecca Monroe: “Uhh…y-yes! I was just getting them settled in now ma’am!”","\n","^Winter Daniels: “Well hurry up! Time is money and you are wasting MINE!”","\n","^Captain Rebecca Monroe: “Yes ma'am! Right away ma'am!”","\n",["ev","str","^Get a Move On","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":"Prologue"},"\n",{"#f":5}]}],{"#f":5}]}],{"#f":1}],"Prologue":["^DEEP SPACE, 4587","\n","^Aboard the S.S. Star Jumper","\n",{"->":"prologue"},{"#f":1}],"prologue":["^C: (Checking her Tech-Pad along with her cockpit display, talking to herself) Ok… Everyone seems to be on the ship with all their stuff... Right! Time to do a walkthrough and make sure this puppy is all ready to fly.","\n",{"->":"ship_base"},{"#f":1}],"ship_base":[["ev","str","^!NEW NOTIFICATION!","/str",{"CNT?":".^.^.winter_warning"},"!",{"CNT?":"dorms_hall"},{"CNT?":"commons_hall"},"&&",{"CNT?":"labs_hall"},"&&","&&","/ev",{"*":".^.c-0","flg":21},["ev",{"^->":"ship_base.0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^Dorm Hallway",{"->":"$r","var":true},null]}],["ev",{"^->":"ship_base.0.15.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^Commons Hallway",{"->":"$r","var":true},null]}],["ev",{"^->":"ship_base.0.16.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":2},{"s":["^Lab Hallway",{"->":"$r","var":true},null]}],["ev",{"^->":"ship_base.0.17.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-4","flg":2},{"s":["^Open Tech-Pad",{"->":"$r","var":true},null]}],{"c-0":["^ ",{"->":".^.^.^.winter_warning"},"\n",{"->":".^.^.^.winter_warning"},{"#f":5}],"c-1":["ev",{"^->":"ship_base.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":"dorms_hall"},{"#f":5}],"c-2":["ev",{"^->":"ship_base.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.15.s"},[{"#n":"$r2"}],"\n",{"->":"commons_hall"},{"#f":5}],"c-3":["ev",{"^->":"ship_base.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.16.s"},[{"#n":"$r2"}],"\n",{"->":"labs_hall"},{"#f":5}],"c-4":["ev",{"^->":"ship_base.0.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.17.s"},[{"#n":"$r2"}],"\n",{"->":"tech_pad"},{"#f":5}]}],{"winter_warning":[["^WD: You better have taken off by now! We don’t have the time to sit around all day and you have some work that needs to be done, if you’re wanting to be paid and keep your job! I’ve sent you a list of exoplanets and descriptions based on our satellite data. I need you and your crew to go down and explore their surfaces! I don’t care what order you do them in, but it better get done fast!","\n","ev","str","^Better Get a Move On","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":".^.^.^.^"},"\n",{"#f":5}]}],{"#f":1}],"#f":1}],"dorms_hall":[["^This is a long hallway with 6 dorm rooms along the left side.","\n",["ev",{"^->":"dorms_hall.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Cpnt. Rebecca's Room",{"->":"$r","var":true},null]}],["ev",{"^->":"dorms_hall.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^Willy Richardson's Room",{"->":"$r","var":true},null]}],["ev",{"^->":"dorms_hall.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^Iris Peacetree's Room",{"->":"$r","var":true},null]}],["ev",{"^->":"dorms_hall.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":2},{"s":["^Dr.Giorgio's Room",{"->":"$r","var":true},null]}],["ev",{"^->":"dorms_hall.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-4","flg":2},{"s":["^Lars Clarckson's Room",{"->":"$r","var":true},null]}],["ev",{"^->":"dorms_hall.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-5","flg":2},{"s":["^Ridan Tyndale's Room",{"->":"$r","var":true},null]}],"ev","str","^Back","/str","/ev",{"*":".^.c-6","flg":4},{"c-0":["ev",{"^->":"dorms_hall.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"rooms.rebecca"},{"#f":5}],"c-1":["ev",{"^->":"dorms_hall.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"rooms.willy"},{"#f":5}],"c-2":["ev",{"^->":"dorms_hall.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"rooms.iris"},{"#f":5}],"c-3":["ev",{"^->":"dorms_hall.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"rooms.giorgio"},{"#f":5}],"c-4":["ev",{"^->":"dorms_hall.0.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"rooms.lars"},{"#f":5}],"c-5":["ev",{"^->":"dorms_hall.0.c-5.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n",{"->":"rooms.ridan"},{"#f":5}],"c-6":["\n",{"->":"ship_base"},{"#f":5}]}],{"#f":1}],"commons_hall":[[["ev",{"^->":"commons_hall.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Commons Room",{"->":"$r","var":true},null]}],["ev",{"^->":"commons_hall.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^Kitchen",{"->":"$r","var":true},null]}],["ev",{"^->":"commons_hall.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^Cargo Bay",{"->":"$r","var":true},null]}],"ev","str","^Back","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["ev",{"^->":"commons_hall.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":"commons.room"},{"#f":5}],"c-1":["ev",{"^->":"commons_hall.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"commons.kitchen"},{"#f":5}],"c-2":["ev",{"^->":"commons_hall.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"commons.cargobay"},{"#f":5}],"c-3":["\n",{"->":"ship_base"},{"#f":5}]}],{"#f":1}],"labs_hall":[[["ev",{"^->":"labs_hall.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Doctors Office",{"->":"$r","var":true},null]}],["ev",{"^->":"labs_hall.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^Research Lab",{"->":"$r","var":true},null]}],["ev",{"^->":"labs_hall.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^Botany Lab",{"->":"$r","var":true},null]}],["ev",{"^->":"labs_hall.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":2},{"s":["^Zoology Lab",{"->":"$r","var":true},null]}],"ev","str","^Back","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["ev",{"^->":"labs_hall.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":"labs.doctor"},{"#f":5}],"c-1":["ev",{"^->":"labs_hall.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"labs.research"},{"#f":5}],"c-2":["ev",{"^->":"labs_hall.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"labs.botany"},{"#f":5}],"c-3":["ev",{"^->":"labs_hall.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"labs.zoology"},{"#f":5}],"c-4":["\n",{"->":"ship_base"},{"#f":5}]}],{"#f":1}],"rooms":[{"->":".^.rebecca"},{"rebecca":["^Captain Rebecca’s Room: Open. Unoccupied.","\n","^Rebecca’s room seems very lived in. There are various posters and pictures of space including various solar systems, stars, planets, and galaxies hanging around her room. Flight manuals, ship maintenance books, and maps of space are scattered around her room and over the floor. Everything in her room seems well-loved and disorganized except for a picture of her family sitting in pristine condition on her nightstand.","\n","^C: Ah… Home sweet home. Do I have to check my room again? I probably should since I was distracted with unpacking before.","\n","^Looking more closely at some of the books scattered around, Rebecca finds the original mission statement from Miss Daniels. She picks it up and places it upon her desk. While at her desk, she looks at the map she has sprawled out showing the star system that her crew would be traveling to with red circles around the planets Regis B, Cyprus 45-B, and X-23. On the edge of her desk is a book titled “Exploring Outer Galaxies: The Guide.” It is well-loved and reminds Rebecca of her time in flight school.","\n",{"->":"dorms_hall"},{"#f":1}],"willy":["^Willy’s Room: Closed.","\n","^C: Oh! This is Willy’s room. It seems like he is not in right now. Welp I’ll just assume that it's all ok.","\n",{"->":"dorms_hall"},{"#f":1}],"iris":["^Iris’ Room: Open. Occupied.","\n","^C: Next up appears to be Iris Peacetree’s room.","\n","^(Rebecca knocks on the door)","\n","^I: (muffled by the door) Come in!","\n","^(Rebecca opens the door and enters Iris’ room)","\n","^Immediately upon walking into her room, Rebecca is met with a rush of warmth. Looking around the room, Iris has already unpacked and decorated most of her room with a few boxes still remaining. In one corner of her room, she has a table with grow lights and various plants sitting under them. On all of her walls, fairy lights hang down from above illuminating the room. Iris has opted not to use the overhead lighting in her room allowing the sole light sources to be her grow lamps and these fairy lights. Also hanging on her walls she has various pictures of plants with an occasional image of her parents or siblings. She has a few posters portraying various sci-fi movies and games. In one of the boxes yet to be unpacked, Rebecca notices various books on horticulture, agriculture, botany, as well as the occasional teen sci-fi romance.","\n","^I: Oh hi there! Captain Rebecca right? What can I help you with?","\n","^C: Hi! Yeah. I just need to check the ship before we are able to take off.","\n","^I: Oh yeah no problem! Please feel free to look around.","\n",{"->":"dorms_hall"},{"#f":1}],"giorgio":["^Dr. Giorgio’s Room: Closed.","\n","^C: And this is Dr. Giorgio’s room. Looks like he is probably in his lab. I’m sure his room is fine.","\n",{"->":"dorms_hall"},{"#f":1}],"lars":["^Lars’ Room: Open. Occupied.","\n","^C: Ok and this here appears to be Lars Clarkson’s room.","\n","^(Rebecca knocks on the door)","\n","^L: (Muffled by door) Uh… Yeah?","\n","^C: Hi. Sorry. I just need to check the rooms before we are able to take off.","\n","^L: (Muffled by door) Oh! Uh… y-yeah come in.","\n","^(Rebecca opens the door and enters)","\n","^Lars is almost completely finished unpacking in his room, currently working on his last box. On his bed, he has various stuffed animals including various types of cats, dogs, birds, and other common animals. He has categorical pictures on his walls each focusing on one class of vertebrate depicting various species of animals and their scientific names under them. He has figurines of animals displayed on his shelves alongside figurines of superheroes and other comic book characters. Aside from the occasional biology or zoology book, Lars seems to only have comic books in his collection.","\n",{"->":"dorms_hall"},{"#f":1}],"ridan":[["^Dr. Ridan’s Room: Open. Unoccupied.","\n","^Captain Rebeccs walks up to the last room in the hallway. She sees that the door to this room is slightly ajar. Her tablet says that the last room belongs to Dr. Ridan.","\n","^C: Hmm. It seems like Dr. Ridan is not in his room, but his door is open for some reason. Maybe he left it open by accident. I should respect his privacy and not snoop through his room. On the other hand I do technically have to check everything before takeoff.","\n",["ev",{"^->":"rooms.ridan.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Enter and snoop.",{"->":"$r","var":true},null]}],["ev",{"^->":"rooms.ridan.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Respect privacy and close the door.",{"->":"$r","var":true},null]}],"ev","str","^BACK","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["ev",{"^->":"rooms.ridan.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n","^When entering the room, Rebecca notices that Ridan has not begun unpacking at all, with a few boxes having their lids open but nothing taken out or spread around the room. There is a life size anatomical model of a human hanging in one corner of his room next to a full model of a human skeleton. Overall, his room feels very empty save for a few bottles containing an unknown liquid scattered around his desk and nightstand.","\n",{"->":"dorms_hall"},{"#f":5}],"c-1":["ev",{"^->":"rooms.ridan.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n",{"->":"dorms_hall"},{"#f":5}],"c-2":["\n",{"->":"dorms_hall"},{"#f":5}]}],{"#f":1}],"#f":1}],"commons":[{"->":".^.room"},{"room":[["^Common Room: Open. Unoccupied.","\n","^Rebecca walks into the common room. With everyone still working hard getting prepared for the trip ahead of them, the common room remains untouched and empty by the members of the crew. There’s a large, red couch sitting on one of the walls with a flatscreen TV amplified to work in the depths of space hanging on the opposite wall. There’s a coffee table in between the two stacked with various magazines, lined with coasters, and the remote for the TV sitting on the edge. There are a few other arm chairs off the heads of the coffee table and an end table on either end of the couch, both completely empty except for a lamp on one. Rebecca ensures that all the furniture in the room is bolted to the floor so that it doesn’t move with the turbulence of the ship.","\n","^C: Everything looks nice and secure! I really hope that we can spend some time together as a crew here!","\n",["ev",{"^->":"commons.room.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Bathrooms",{"->":"$r","var":true},null]}],"ev","str","^Back","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["ev",{"^->":"commons.room.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"commons.bathroom"},{"#f":5}],"c-1":["\n",{"->":"commons_hall"},{"#f":5}]}],{"#f":1}],"bathroom":[["^Bathrooms: Open.","\n","^In the bathrooms, Rebecca had walked in to see three stalls, three sinks, and three showers allowing for half the crew to use any specific part of the bathroom at any time. The bathrooms were not split by gender and were communal for all members of the crew. The interior was a very reflective white marble appearance with bright lighting illuminating every inch of the room. The center of the room was decently spacious with a bench in the middle of the room for those using the various features.","\n","^C: There’s nothin’ in here that I need to check.","\n","ev","str","^Back","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"commons_hall"},{"#f":5}]}],{"#f":1}],"kitchen":[["^Kitchen: Open. Unoccupied.","\n","^Rebecca ventures into the kitchen. It has brand new chrome appliances that were replaced just before this crew was chosen for the research mission. There’s a large fridge stocked with years worth of food thanks to enhanced technology. There are three ovens and stoves lining the wall with smoke hoods over each. There’s a large metallic shelf on one end of the kitchen stacked with pots, pans, plates, utensils, and every other dish imaginable. On the counter, there were other appliances including toasters, air fryers, and fabricators capable of creating small dishes from thin air. There was also a large wooden table with 6 chairs surrounding it. Rebecca went through and ensured that everything was stabilized in place to keep it from shifting as the ship flew around.","\n","^C: Unfortunate that we couldn’t get a chef on this expedition. Maybe I can convince someone else in the crew to cook for me.","\n","ev","str","^Back","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"commons_hall"},{"#f":5}]}],{"#f":1}],"cargobay":[["^Cargobay: Open. Occupied.","\n","^Walking into the cargo bay, Rebecca is met with a large, disorganized mess of a room. Boxes are scattered around the room, some are open while others are still sealed. All of the non-food supplies the crew will need during their exploration is stored in this room. Despite the size of the room, the mess of supplies still takes up the majority of the space present. At the back end of the room, there’s a large air-locked door leading outside of the ship for loading and unloading the ship at necessary points in time. Willy is in a far end of the room examining the contents of the boxes.","\n",["ev",{"^->":"commons.cargobay.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Willy",{"->":"$r","var":true},null]}],["ev",{"^->":"commons.cargobay.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^Cargobay Door",{"->":"$r","var":true},null]}],"ev","str","^Back","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["ev",{"^->":"commons.cargobay.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^C: How’s it goin’ Sergeant?","\n","^W: Everything’s fine over here! I saw how disorganized everything in here was so I thought I’d try to make it a bit easier to find things!","\n","^C: I hope it isn’t too much trouble! There’s a lot of supplies in here so don’t overwork yourself on the first day either!","\n",["ev","str","^Back","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":".^.^.^.^.^"},{"#f":5}]}],{"#f":5}],"c-1":["ev",{"^->":"commons.cargobay.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"commons.baydoor"},{"#f":5}],"c-2":["\n",{"->":"commons_hall"},{"#f":5}]}],{"#f":1}],"baydoor":[["^Door: Closed.","\n","^Closer inspection of the door reveals that it is tightly sealed and does not appear to have any issues in closing and protecting the crew from the vacuum of space.","\n","^C: Everything here looks all good to fly!","\n","ev","str","^Back","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"commons.cargobay"},{"#f":5}]}],{"#f":1}],"#f":1}],"labs":[{"->":".^.doctor"},{"doctor":[["^Doctors Office: Open. Occupied.","\n","^In the doctor’s office, Rebecca sees shelves lined with various jars and containers of medical supplies like bandages, cotton balls, gloves, masks, and every piece of first aid that anyone could need in their life. There’s a small desk built into an alcove on the wall where Ridan sits hunched over some paperwork with a desk lamp providing dim light for his work. Throughout the rest of the room, Rebecca sees an examination table, old-school scale, sickbay bed, and a few other chairs scattered around the borders.","\n","^C: Oh! Dr. Ridan hi! It is so great to meet you and I am so happy to have you as a part of our crew.","\n","^R: Sighs Yep. Great to be here. (He says sarcastically)","\n","^C: Ok. Well, uh, I just need to check out the room to make sure we are all good for our journey.","\n","^R: Go ahead. Knock yourself out. … Please don’t actually knock yourself out.","\n","^C: Ok will do and not do.","\n","ev","str","^Back","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"labs_hall"},{"#f":5}]}],{"#f":1}],"research":[["^Main Research: Open. Occupied.","\n","^Rebecca ventures to the main research lab. Inside were various machines and instruments that she couldn’t even fathom the purposes of. Computer screens were filled with spreadsheets of data. Beeps could be heard periodically emitting from some of the machines. Tables sat in the middle of the room reminiscent of the lab tables Rebecca saw in her high school biology class. Rebecca was dumbfounded by the sheer amount of scientific machines around the room that she had never seen before.","\n","^C: Oh wow this place is crazy!","\n","^G: Don’t. Touch. Anything.","\n","^C: Oh! Right. Got it! Hey you’re Dr. Giorgio right! Nice to meet you. I just ran into Dr. Ridan. Isn’t it so funny that we have two doctors on the ship but like hes a medicine doctor and you’re science doctor.","\n","^G: Uh huh…","\n","^C: Anyways I just needed to check around the room to make sure everything is secure and we are all good for take off.","\n","^G: Ok. Just please stay out of my way.","\n","ev","str","^Back","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"labs_hall"},{"#f":5}]}],{"#f":1}],"botany":[["^Plant Lab: Open. Unoccupied.","\n","^Entering the plant lab, Rebecca saw short tables line the room in neat rows. Each table had large lights hanging low over them and the tables were covered in pots and grow beds. There was a desk on the farthest wall from the entrance that had a few papers scattered on it and a box opened with microscopes, soil probes, pH meters, and other instruments used to study plant life. While the room was largely empty save for a few flowers and fruits native to Earth in the far corner of the room, she knows that any plant specimen collected by the crew throughout their expedition would be brought here for Iris to research.","\n","^C: I can’t wait until we have some more plants to fill up this room! You can take the girl out of the farm but that doesn’t mean the farmer leaves the girl!","\n","ev","str","^Back","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"labs_hall"},{"#f":5}]}],{"#f":1}],"zoology":[["^Animal Lab: Closed.","\n","^While the animal lab was currently closed, Rebecca peered through the window to gaze into the room before her. On one side of the room, she saw countless cages and glass containers of various sizes fill the wall from floor to ceiling. Presumably, this is where any animal species would be kept for research by Lars. There was an operating table in the middle of the room where she could picture examinations of these alien species would occur. There were some sealed boxes on the desk in the corner of the room that Rebecca assumed would be filled with any of the tools needed to do the research required.","\n","^C: I can’t wait to see all the new species we’re gonna come across throughout this trip!","\n","^After checking everything out, Rebecca notes that the crew members are all on board, everyone is tending to their rooms and unpacking as they need, and people begin to settle into their places. Finishing up the last system checks, Rebecca starts the ship’s engine. Breaking through the gravitational pull of Earth, the ship staggers and shakes with large amounts of turbulence.","\n","^Breaking into the dark abyss, the Earth begins to trail behind them and the ship smooths out a bit, but still maintains an unusual amount of turbulence from the rough manor Rebecca handles the ship in. As Rebecca makes her way out of the Solar System, she receives a ping on a communications computer nearby.","\n","ev","str","^Back","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"labs_hall"},{"#f":5}]}],{"#f":1}],"#f":1}],"tech_pad":[[["ev",{"^->":"tech_pad.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Open Mission Brief",{"->":"$r","var":true},null]}],["ev",{"^->":"tech_pad.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^Pick-a-Planet Module",{"->":"$r","var":true},null]}],"ev","str","^CLOSE PAD","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["ev",{"^->":"tech_pad.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^There are three planets I’ve tasked your crew with researching: ",{"->":".^.^.^.planets"},"\n",{"#f":5}],"c-1":["ev",{"^->":"tech_pad.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",[["ev",{"^->":"tech_pad.0.c-1.7.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Regis-B",{"->":"$r","var":true},null]}],["ev",{"^->":"tech_pad.0.c-1.7.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Cyprus 45-B",{"->":"$r","var":true},null]}],["ev",{"^->":"tech_pad.0.c-1.7.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^X-23",{"->":"$r","var":true},null]}],"ev","str","^BACK","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["ev",{"^->":"tech_pad.0.c-1.7.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":"chosen_first"},{"#f":5}],"c-1":["ev",{"^->":"tech_pad.0.c-1.7.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"chosen_second"},{"#f":5}],"c-2":["ev",{"^->":"tech_pad.0.c-1.7.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"chosen_third"},{"#f":5}],"c-3":["^ ",{"->":"tech_pad"},"\n",{"#f":5}]}],{"#f":5}],"c-2":["^ ",{"->":"ship_base"},"\n",{"#f":5}]}],{"planets":[[["ev",{"^->":"tech_pad.planets.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Regis B:",{"->":"$r","var":true},null]}],["ev",{"^->":"tech_pad.planets.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^Cyprus 45-B:",{"->":"$r","var":true},null]}],["ev",{"^->":"tech_pad.planets.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^X-23:",{"->":"$r","var":true},null]}],"ev","str","^BACK","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["ev",{"^->":"tech_pad.planets.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^A large blue planet about three times the size of Earth, mostly covered in water with archipelagos dotting the cerulean oceans with little green specks.","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["ev",{"^->":"tech_pad.planets.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^A planet slightly smaller than Earth. Located near a red dwarf star, the planet’s temperature readings are extremely cold and the geography appears very homogenous and rocky.","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["ev",{"^->":"tech_pad.planets.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n","^A planet about 1.5 times the size of Earth. X-23 is located in the system of a blue star causing the planet to have very high temperatures and a very dry climate. The surface is made up almost entirely of dry plateaus and sandy dunes with a desert like appearance.","\n",{"->":".^.^.^"},"^\"W. Daniels\"","\n",{"#f":5}],"c-3":["\n",{"->":"tech_pad"},"end",{"#f":5}]}],{"#f":1}],"#f":1}],"Endings":[["ev","str","^Colonization","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Fired","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Regular","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^MasterResearchers","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Mismatch","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["\n",{"->":"Colonization"},{"#f":5}],"c-1":["\n",{"->":"Fired"},{"#f":5}],"c-2":["\n",{"->":"Regular"},{"#f":5}],"c-3":["\n",{"->":"MasterResearchers"},{"#f":5}],"c-4":["\n",{"->":"Mismatch"},{"#f":5}]}],{"#f":1}],"Colonization":["^And they then Colonized the Planet!","\n","end",{"#f":1}],"Fired":["^Captain Rebecca receives a ping on her communications device. The message is from Winter Daniels about the recent failure.","\n","^Winter Daniels: You failed to gather sufficient information on two of the three planets I have tasked you with exploring. To save myself any further loss in my expenses, I am hereby terminating my sponsorship of this research project. You will receive no more funding from me and I urge all of you to return from this expedition.","\n","^Captain Rebecca notifies the rest of the crew that the research mission was a failure and they had all lost their jobs. The crew sat in solemn silence and all retired to their respective chambers, not daring to speak with each other as they each either feel as though the failure is their own fault or are blaming the other members of the crew for this outcome.","\n","end",{"#f":1}],"Regular":["^Captain Rebecca receives a ping on her communications device. The message is from Winter Daniels about the completion of their mission.","\n","^Winter Daniels: Congratulations on completing your mission. You have gathered sufficient data for this mission and I’m deeming it a success. If you would like to continue your work with my funding, return home at once and I will have another research expedition prepared for your crew.","\n","^Captain Rebecca then notified the crew of their successful expedition and all members agreed to continue working together. She piloted the ship back towards their home planet and they all began preparations for their next excursion.","\n","end",{"#f":1}],"MasterResearchers":["^Captain Rebecca receives a ping on her communications device. The message is from Winter Daniels about the overwhelming success of their mission.","\n","^Winter Daniels: Amazing work out there! Your crew gathered ample data on every planet you visited. I couldn’t ask for a better team to have carried out this expedition. I have nominated your crew to be recognized interplanetarily for the work and research you all have carried out. You should never have to worry about finding work again! You’re all going to be recognized as pioneers and top tier researchers for the rest of your careers.","\n","^Rebecca notified the crew of their resounding success and they all celebrated on the ship with one another. They began their trip back to their home planet, excited for everything that the future will hold for them.","\n","end",{"#f":1}],"Mismatch":["^Tensions in the crew run high as communication between the members falters. Rebecca decides to make an announcement over the PA system.","\n","^Captain Rebecca: Hey crew, I get the feeling that we don’t really get along with one another. Dr. Giorgio and I have reached out to Winter Daniels and we all agreed it’s best we return home and gather a new crew that works together better. Sorry it had to be like this!","\n","^With that final announcement, Rebecca quickly pilots the ship back to their home planet and drops off all members of the crew, awaiting the new researches that would be assigned to her vessel.","\n","end",{"#f":1}],"global decl":["ev",{"list":{},"origins":["Team"]},{"VAR=":"Team"},{"list":{}},{"VAR=":"teamOne"},{"list":{}},{"VAR=":"teamTwo"},{"list":{}},{"VAR=":"teamThree"},false,{"VAR=":"both_routes"},"/ev","end",null],"#f":1}],"listDefs":{"Team":{"Rebecca":1,"Willy":2,"Iris":3,"Lars":4,"Ridan":5}}}